---
kind: method
id: M:Autodesk.Revit.DB.CurveByPointsArray.ReverseIterator
source: html/24aaa9ad-5d68-daed-191e-f5757f03ca52.htm
---
# Autodesk.Revit.DB.CurveByPointsArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual CurveByPointsArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.